In [1]:
import numpy as np
import pandas as pd
np.random.seed(101)

# SERIES

In [2]:
labels = ['a','b','c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series([1,2,3,4],['USA','GER','ITA','USSR'])
ser1

USA     1
GER     2
ITA     3
USSR    4
dtype: int64

In [8]:
ser2 = pd.Series([1,2,3,4],['USA','GER','ITA','JAP'])
ser2

USA    1
GER    2
ITA    3
JAP    4
dtype: int64

In [9]:
ser3 = pd.Series([1,2,3,4])
ser3

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
print(ser1['USA'])
print(ser2['ITA'])
print(ser3[3])
print(ser1[1])

1
3
4
2

In [11]:
ser1 + ser2

GER     4.0
ITA     6.0
JAP     NaN
USA     2.0
USSR    NaN
dtype: float64

# DATAFRAME

In [12]:
df = pd.DataFrame(data=np.random.randn(5,4), index=['A','B','C','D','E'], columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [14]:
type(df['Y'])

pandas.core.series.Series

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [17]:
type(df[['W','Y']])

pandas.core.frame.DataFrame

In [18]:
df['new'] = df['W'] + df['X'] 
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [19]:
df.drop('new', axis=1) # axis=1 is to delete column, if you want to delete row default axis parameter is fine
                       # use inplace if you want to delete permanently

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [21]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df.drop('E')
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [24]:
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [25]:
df.loc['C','X']

0.7401220570561068

In [27]:
df.loc[['A','D'],['X','Z']]

          X         Z
A  0.628133  0.503826
D -0.758872  0.955057

In [50]:
df['W']['C']

-2.018168244037392

In [32]:
df.loc['C']['W']

-2.018168244037392

In [37]:
df.loc[['A','D']][['X','Z']]

          X         Z
A  0.628133  0.503826
D -0.758872  0.955057

## Conditional Selection

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [45]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [47]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[(df['W']>0) & (df['X']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df['new_col'] = "IST DEN ANK IZM ANT".split()
df

          W         X         Y         Z new_col
A  2.706850  0.628133  0.907969  0.503826     IST
B  0.651118 -0.319318 -0.848077  0.605965     DEN
C -2.018168  0.740122  0.528813 -0.589001     ANK
D  0.188695 -0.758872 -0.933237  0.955057     IZM
E  0.190794  1.978757  2.605967  0.683509     ANT

In [58]:
df.set_index(keys='new_col')

                W         X         Y         Z
new_col
IST      2.706850  0.628133  0.907969  0.503826
DEN      0.651118 -0.319318 -0.848077  0.605965
ANK     -2.018168  0.740122  0.528813 -0.589001
IZM      0.188695 -0.758872 -0.933237  0.955057
ANT      0.190794  1.978757  2.605967  0.683509

In [59]:
df

          W         X         Y         Z new_col
A  2.706850  0.628133  0.907969  0.503826     IST
B  0.651118 -0.319318 -0.848077  0.605965     DEN
C -2.018168  0.740122  0.528813 -0.589001     ANK
D  0.188695 -0.758872 -0.933237  0.955057     IZM
E  0.190794  1.978757  2.605967  0.683509     ANT

# MISSING DATA

In [60]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [61]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [63]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [71]:
df.dropna(thresh=2) #row needs to contain non-nan values greater or equal to thresh value,otherwise it will be dropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [73]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
df.fillna(value='NEW VALUE')

           A          B  C
0          1          5  1
1          2  NEW VALUE  2
2  NEW VALUE  NEW VALUE  3

In [75]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [78]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [79]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

# GROUPBY

In [80]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [85]:
by_company = df.groupby('Company')
by_company

In [86]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [87]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [88]:
by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [92]:
by_company.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [89]:
by_company.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [90]:
by_company.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [91]:
by_company.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# OPERATIONS

In [93]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [94]:
df['col2'].unique()

array([444, 555, 666])

In [95]:
df['col2'].nunique()

3

In [96]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [97]:
df['col1'].sum()

10

In [98]:
df['col1'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [100]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [101]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [107]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [108]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False